![Table 6-1](6_1.png)

In [4]:
import pandas as pd #Must not rerun all codes
import sys

In [3]:
df = pd.read_csv("TestRead.csv", header = None)
df

,0,1,2,3,4,5,6,7,8,9
0,1234567890,Mike,123,St Petersburg,Wollongong,Wollongong,NSW,2500,100000,2020-05-25
1,9876543210,Peter,321,Hope,Wollongong,Wollongong,NSW,2500,150000,2019-05-25

In [4]:
df = pd.read_csv("TestRead.csv", header = None, names = ['Id', 'Name', 'St num', 'St name', 'suburb', 'city', 'state', 'postcode', 'point', 'date'])
df

,Id,Name,St num,St name,suburb,city,state,postcode,point,date
0,1234567890,Mike,123,St Petersburg,Wollongong,Wollongong,NSW,2500,100000,2020-05-25
1,9876543210,Peter,321,Hope,Wollongong,Wollongong,NSW,2500,150000,2019-05-25

In [5]:
df = pd.read_csv("TestRead.csv", header = None, names = ['Id', 'Name', 'St num', 'St name', 'suburb', 'city', 'state', 'postcode', 'point', 'date'], index_col = 'date')
df

,Id,Name,St num,St name,suburb,city,state,postcode,point
date,,,,,,,,,
2020-05-25,1234567890,Mike,123,St Petersburg,Wollongong,Wollongong,NSW,2500,100000
2019-05-25,9876543210,Peter,321,Hope,Wollongong,Wollongong,NSW,2500,150000

In [7]:
df = pd.read_csv("TestRead.csv", header = None, names = ['Id', 'Name', 'St num', 'St name', 'suburb', 'city', 'state', 'postcode', 'point', 'date'], index_col = ['date', 'Name'])
df

,,Id,St num,St name,suburb,city,state,postcode,point
date,Name,,,,,,,,
2020-05-25,Mike,1234567890,123,St Petersburg,Wollongong,Wollongong,NSW,2500,100000
2019-05-25,Peter,9876543210,321,Hope,Wollongong,Wollongong,NSW,2500,150000

In [8]:
list(open('TestRead.csv'))

['1234567890,Mike,123,St Petersburg,Wollongong,Wollongong,NSW,2500,100000,2020-05-25\n',
 '9876543210,Peter,321,Hope,Wollongong,Wollongong,NSW,2500,150000,2019-05-25\n']

In [11]:
result = pd.read_table('TestRead.csv', sep=",", header = None)
result

,0,1,2,3,4,5,6,7,8,9
0,1234567890,Mike,123,St Petersburg,Wollongong,Wollongong,NSW,2500,100000,2020-05-25
1,9876543210,Peter,321,Hope,Wollongong,Wollongong,NSW,2500,150000,2019-05-25

In [20]:
!TestRead.csv

In [17]:
result = pd.read_csv("TestRead.csv", header=None)
result

,0,1,2,3,4,5,6,7,8,9
0,1234567890,Mike,123,St Petersburg,Wollongong,Wollongong,NSW,2500,NaN,5/25/2020
1,9876543210,Peter,321,Hope,Wollongong,Wollongong,NaN,2500,150000.0,5/25/2019

In [18]:
result.isnull()

       0      1      2      3      4      5      6      7      8      9
0  False  False  False  False  False  False  False  False   True  False
1  False  False  False  False  False  False   True  False  False  False

In [19]:
#Resolve missing data:
missing = {6:'NSW', 8:0}
pd.read_csv("TestRead.csv", na_values = missing, header = None)

,0,1,2,3,4,5,6,7,8,9
0,1234567890,Mike,123,St Petersburg,Wollongong,Wollongong,NaN,2500,NaN,5/25/2020
1,9876543210,Peter,321,Hope,Wollongong,Wollongong,NaN,2500,150000.0,5/25/2019

![Table 6-2](6_2.png)

**Reading Text Files in Pieces**

In [1]:
#User nrows to avoid reading the entire file
#E.g: pd.read_csv('examples/ex6.csv', nrows=5)

**Writing Data to Text Format**

In [3]:
data = pd.read_csv("TestRead.csv")
data.to_csv("TestWrite.csv")

In [5]:
data.to_csv(sys.stdout, na_rep=-999, sep = '|')

|1234567890|Mike|123|St Petersburg|Wollongong|Wollongong.1|NSW|2500|Unnamed: 8|5/25/2020
0|9876543210|Peter|321|Hope|Wollongong|Wollongong|-999|2500|150000|5/25/2019

**Working with Delimited Formats**

In [8]:
import csv
reader = csv.reader(open("TestRead.csv"))
for line in reader:
    print(line)

['1234567890', 'Mike', '123', 'St Petersburg', 'Wollongong', 'Wollongong', 'NSW', '2500', '', '5/25/2020']
['9876543210', 'Peter', '321', 'Hope', 'Wollongong', 'Wollongong', '', '2500', '150000', '5/25/2019']

In [9]:
reader

![Table 6-3](6_3.png)

**JSON Data**

In [10]:
import json
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
result = json.loads(obj)#Convert JSON string to Python form
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [12]:
asjson = json.dumps(result)#convert python to json

In [14]:
siblings = pd.DataFrame(result['siblings'], columns = ['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [16]:
obj =  pd.read_json('TestJson.json')
obj

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

**Web Scraping**

In [17]:
url = "https://en.wikipedia.org/wiki/Monaco_Grand_Prix"

In [18]:
tables = pd.read_html(url)
len(tables)

18

In [25]:
tables[2].head()

,Wins,Constructor,Years won[23],Years won[23].1
0,15,McLaren,"1984, 1985, 1986, 1988, 1989, 1990, 1991, 1992...",NaN
1,10,Ferrari,"1952, 1955, 1975, 1976, 1979, 1981, 1997, 1999...",NaN
2,8,Mercedes,"1935, 1936, 1937, 2013, 2014, 2015, 2016, 2019",NaN
3,7,Lotus,"1960, 1961, 1968, 1969, 1970, 1974, 1987",NaN
4,5,BRM,"1963, 1964, 1965, 1966, 1972",NaN

**Parsing XML with lxml.objectify**

In [33]:
from lxml import objectify
path = 'Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()
root

In [34]:
data = []
skip_fields = ['PARENT_SEQ','INDICATOR_SEQ','DESIRED_CHANGE','DECIMAL_PLACES']
for elt in root:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [35]:
perf = pd.DataFrame(data)
perf

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,Escalator Availability,Percent of the time that escalators are operat...,2011,12,Service Indicators,M,%,97.0,,97.0,